app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."enabled" = $1  [["enabled", "t"]]
---
	def index
			@items = Item.where(enabled: true)