app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    redirect_to login_path unless current_user
    if admin_user? && request_path == 'usersorders'
      @user = User.find(params[:user_id])
      @orders = Order.where(user_id: @user.id)
      @heading = "All User Orders for #{@user.name}"
    elsif admin_user? && request_path == 'orders'
      @orders = Order.all