app/controllers/users_controller.rb

INSERT INTO "users" ("name", "address", "city", "state", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    redirect_to login_path unless current_user
    if params[:id] && current_user.role == 'admin'
      @user = User.find(params[:id])